santhoshsandysan/Ti-cc2340/Temp_logger/empty.syscfg
/*
 * Copyright (c) 2018-2025, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
// @cliArgs --board /ti/boards/LP_EM_CC2340R5 --rtos freertos

/*
 *  empty.syscfg
 */
var Power = scripting.addModule("/ti/drivers/Power");

/* ======== Kernel Configuration ======== */
system.getScript("kernel_config_release.syscfg.js");

/* ======== GPIO ======== */
var GPIO = scripting.addModule("/ti/drivers/GPIO");
var gpio = GPIO.addInstance();
gpio.$hardware = system.deviceData.board.components.LED0;
gpio.$name = "CONFIG_GPIO_LED_0";

if(system.deviceData.deviceId.match(/CC35.*/)) {
    const ActionReq = scripting.addModule("/ti/vendorutils/Action/ActionReq");
    const EMMap     = scripting.addModule("/ti/externalmemory/EMMap/EMMap");
    const OTFDE     = scripting.addModule("/ti/externalmemory/OTFDE");
    const XSPI      = scripting.addModule("/ti/externalmemory/XSPI");

    ActionReq.primary_vendor_image = true;
    ActionReq.primary_vendor_image_validate = false;

    XSPI.xspi.clk.$assign   = "GPIO24";
    XSPI.xspi.flash.$assign = "GPIO20";
    XSPI.xspi.data0.$assign = "GPIO25";
    XSPI.xspi.data1.$assign = "GPIO21";
    XSPI.xspi.data2.$assign = "GPIO22";
    XSPI.xspi.data3.$assign = "GPIO23";
    XSPI.use_hw             = "IS25WJ032F";
}
